# -*- coding: utf-8 -*-

#+TITLE: Classification non supervisée - Clustering {{{NEWLINE}}}{{{NEWLINE}}} {{{HTMLFONTSIZE(Introduction et notions fondamentales,10)}}}
#+AUTHOR: Roland Donat
#+EMAIL: roland.donat@univ-ubs.fr
#+DATE: {{{NEWLINE}}}STID2 - Année universitaire 2020-2021

*** Critères de qualité d'une classification
{{{SUBTITLE(Exemple)}}}

#+REVEAL_HTML: <div class="column" style="float:left; width: 50%">

#+BEGIN_SRC python :session c1_ex_inertie_cls_rnd :results html :exports results
import plotly.io as pio
from c1_ex_inertie_cls_rnd import data_classif_fig

pio.to_html(data_classif_fig, include_plotlyjs="cdn",
            full_html=False,
            default_height="500",
            default_width="500",
            config={'displayModeBar': False})
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session c1_ex_inertie_cls_rnd :results html :exports results
from c1_ex_inertie_cls_rnd import cls_summary

cls_summary_df = cls_summary.to_frame().transpose()
format_dict = {var: '{:.2f}' for var
               in cls_summary_df.select_dtypes(float).columns}
props = [('font-size', '16px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

cls_summary_df.style\
              .format(format_dict)\
              .set_table_styles(data_styles)\
              .render()
#+END_SRC

#+RESULTS:

#+REVEAL_HTML: </div>

#+REVEAL_HTML: <div class="column" style="float:right; width: 50%">

#+BEGIN_SRC python :session c1_ex_inertie_cls_kmeans :results html :exports results
import plotly.io as pio
from c1_ex_inertie_cls_kmeans import data_classif_fig

pio.to_html(data_classif_fig, include_plotlyjs="cdn",
            full_html=False,
            default_height="500",
            default_width="500",
            config={'displayModeBar': False})
#+END_SRC

#+RESULTS:
#+begin_export html
#+end_export

#+BEGIN_SRC python :session c1_ex_inertie_cls_kmeans :results html :exports results
from c1_ex_inertie_cls_kmeans import cls_summary

cls_summary_df = cls_summary.to_frame().transpose()
format_dict = {var: '{:.2f}' for var
               in cls_summary_df.select_dtypes(float).columns}
props = [('font-size', '16px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

cls_summary_df.style\
              .format(format_dict)\
              .set_table_styles(data_styles)\
              .render()
#+END_SRC

#+RESULTS:

#+REVEAL_HTML: </div>


